package com.dp;

/**
 * @Author: DZF
 * @Date: 2022年8月14日 下午6:50:07
 * @Version: 1.0
 * @Description:
 */
public class Test {

	public static void main(String[] args) {
		String s = "温和的阳光自被微风吹拂的轻轻晃荡的绿叶间照耀在郁郁葱葱的草坪上。　　一个身穿白色上面有着银色花饰长裙的少女正靠做在一颗大树上，用漆黑的眸子注视着远处蔚蓝的天空。　　已经十四年了，冰华从原本的世界来到这个世界已经足足有了十四个年头。　　最让她惆怅的是她从他变成了她，很绕口是不是。　　简单清晰的来说，她上一世只是渺渺众生中的一员，在父母的期望下考上了高中，开始向着大学进发。　　可是一场突然发生的车祸夺走了他年轻的生命，让他带着记忆在另一个世界中作为她而重生。　　而这一世她的名字就叫做冰华，一个很平常的名字，没有父母的期望和特殊的寓意，只是一个平平常常的名字而已。　　冰华之所以会坐在这里，是因为在这个地方，不应该说是这颗星球。　　这里不是神界，也不是传说中的天堂，而是一片叫做天使星云的内部行星上。　　而这里的女性地位并不高，不如说普通的女性只是男性的附庸，只有一些贵族的子女才稍微有一点自由度，但也只是一点而已。　　但很讽刺的是这颗星球上的种族，却叫做天使，前世只生活在传说和书中的天使，是神的代言人，上帝的使者，具备博爱，公正，纯洁的美好品德。　　可这颗星球上的天使呢，男天使仗着自己基因强大，将女性天使当做玩物，附庸，追求快乐的玩具。　　同时男性天使们还限制女性天使的权利，剥夺她们基因进化所需的资源，女性天使的寿命只有数百年左右。　　而男性天使只要没有陨落，身体中的天使基因进化的足够强大，寿命最少都能达到数千年。　　可最难理解的就是这里的科技水平却非常高超，可还是类似于上一世古代封建社会的王权至上。　　整个天使种族的资源都集中在天使之王华榷身上，这造就了他恐怖无比的实力和无比漫长的寿命。　　据书中记载，天使王华榷已经在位了最少万年的漫长时光，即使是在宇宙中他的名号也很是响亮。　　冰华之所以在这里就是因为这点，可能是为了补偿她上一世的英年早逝，这一世她的出身很是优越。　　她的父亲是天使王华榷麾下的大将，随着天使之王南征北战立下了赫赫战功。　　可即使是这样冰华在家中的地位也不高，只能说不会被别人欺凌和不愁吃穿罢了。　　想要获得大量的资源强化身体内的天使基因是不可能的，她的父亲根本不会这样做。　　她那个自从她诞生只见过数面的父亲，只会将家里全部的资源用来强化她的两位哥哥们。　　冰华抬起自己的纤细如同玉脂的手臂，看着自己柔弱的胳膊和身体，可就是这幅柔弱的身体中也蕴涵着超人般恐怖的力量。　　起码能打前世一百个他，这就是天使基因的强大。　　&ldquo;冰华小姐，夫人让你回去。&rdquo;　　一名穿着白色衣裙的中年女性天使从冰华背后的树林中走出，低声开口说道。　　&ldquo;知道了，我一会就回去。&rdquo;　　冰华起身拍拍身上洁白衣裙上沾染的几颗草屑，转身时如瀑一样漆黑发亮的的长发被微风吹拂着轻轻在脑后飘荡。　　这时树梢间投射而下的阳光正好照射在冰华身上，让冰华此刻在一边的中年女性天使眼中变得无比惊艳。　　一间很是奢华的餐厅中，冰华和自己的母亲还有两位哥哥正在一起进餐。　　餐厅很大空无一人的主位背后是几扇巨大的落地窗，丝丝的微风将绣有不知名白金花朵的洁白窗帘吹的微微晃动。　　而外面的光线经过了窗帘的过滤，照射进餐厅内也变得很是柔和，并不会让人觉的刺眼。　　冰华面前的餐桌很长差不多在十米左右，其主体是如同白瓷般的光洁白色不知名金属打造，另外餐桌和桌腿边沿还包裹了一层金色的金属。　　就连冰华面前的盛放着食物的盘子也精美就像是一个艺术品。　　冰华坐在自己的位置上沉默的吃着面前盘子中的食物，而他对面两位棕黄色头发的俊美男子正小声的说着一些外面的话题。　　如外面那里出现了什么好看的女天使，或者是父亲又怎么，怎么了&hellip;&hellip;　　反正都是一些没有营养的话语，冰华并不感兴趣，不如说很讨厌对面两位偶尔讨论女天使时的露骨话题。　　如果要是前世的自己说不定很有兴趣参与进去，与他们一同探讨一番，可现在冰华只能感觉到厌恶这一种情绪。　　可是是因为她的生理变为了女性，导致她的思维也更加的偏向女性。　　因为她的两位哥哥话语中完全没有将女性天使当做同族的意思，更像是对待随意就能玩弄的奴隶那样。　　&ldquo;我吃完了。&rdquo;　　冰华将刀叉放在面前没动过的盘子旁边，然后向着自己的母亲打了一个招呼，在得到母亲的同意后就离开了。　　走过缠绕着各种花朵和藤蔓的走廊，一旁是在阳光的照耀下闪闪发光的清澈流水，加上不远处的茂密的树木，让这里就像是一座人间仙境。　　冰华打开自己房间的房门，走了进去，这里是她的卧室。　　房间中的东西很少，只有一个带着镜子看起来很精美的白色梳妆台，和窗边白色的书桌，加上两个带着软垫的米黄色椅子，剩下唯一的就是在房间正中间的白色大床和一旁的衣柜了。　　冰华坐在窗户旁的椅子上，枕着自己手臂出神的看着窗外的蓝天白云。　　虽然她才十四岁，在以天使的年龄来看就是一个小的不能在小的小小女孩，可冰华却已经明白了自己的命运。　　作为天使之王华榷手下大将的女儿，以后的命运想都能想的出来。　　第一是作为联姻的工具，嫁给自己不认识的男性天使，因为她的身份原因倒是不会像普通的女天使那样成为玩物，可也不会过的太好。　　第二就是成为天使王族的妃子，成为一个彻彻底底的玩物花瓶。　　相信以她父亲的身份，第二个命运发生的可能性很小，不然也不会让她一直待在家里不要出门了。　　就在这时房间的门被敲响了，门外传来一名妇人的声音。ŴŴŴ.ŴßЖŚŴ.ČŐM　　&ldquo;冰华，你在里面吗？&rdquo;" ; 
		String strNew = s.replaceAll("[a-zA-Z\\$&;]","");
	    System.out.println(strNew);
	    
	    

	}

}
